In [2]:
import sqlite3
db = sqlite3.connect("student_database.db")

In [3]:
cursor = db.cursor()

In [10]:
cursor.execute("CREATE TABLE student_data5(phone_no INT PRIMARY KEY , email_id TEXT, course_name TEXT , fee_paid TEXT)")

In [11]:
with open('DT_Students.csv', 'r') as file:
    no_records = 0 
    for row in file:
        cursor.execute("INSERT INTO Student_data5 VALUES (?,?,?,?)",row.split(','))
        db.commit()
        no_records +=1
print(no_records , 'records inserted')

20 records inserted

In [12]:
cursor.execute("CREATE TABLE stud_det(phone_no INT primary key , student_name TEXT , enrolled_date TEXT , marks INT)")
with open('Students_details.csv','r') as file:
    no_records = 0
    for row in file:
        cursor.execute("INSERT INTO stud_det VALUES(?,?,?,?)",row.split(','))
        db.commit()
        no_records +=1
print(no_records,'records inserted')

20 records inserted

# join :
different type of SQLs join.if we want to join different table then join is used
(inner) join : returns records that have matching values in both the tables.
left(outer) join : return all the records from the left table and the matched records from the right table
right(outer) join: return all the records from the right table and the matched records from the left table
full(outer) join: return all the joins when there is a match in either left or right table

In [13]:
result = cursor.execute("SELECT * from student_data5")
for row in result:
    print(row)

(9988776604, 'student4@gmail.com', 'Digital Marketing', '38000\n')
(9988776605, 'student5@gmail.com', 'Data Science', '133000\n')
(9988776606, 'student6@gmail.com', 'Data Science', '34000\n')
(9988776607, 'student7@gmail.com', 'Data Science', '33000\n')
(9988776608, 'student8@gmail.com', 'Data Science', '129000\n')
(9988776609, 'student9@gmail.com', 'Data Science', '40000\n')
(9988776610, 'student10@gmail.com', 'Data Analytics', '32500\n')
(9988776611, 'student11@gmail.com', 'Data Science', '41500\n')
(9988776612, 'student12@gmail.com', 'Digital Marketing', '31000\n')
(9988776613, 'student13@gmail.com', 'Digital Marketing', '23000\n')
(9988776614, 'student14@gmail.com', 'Data Science', '24000\n')
(9988776615, 'student15@gmail.com', 'Data Science', '23000\n')
(9988776616, 'student16@gmail.com', 'Data Science', '122500\n')
(9988776617, 'student17@gmail.com', 'Data Science', '29000\n')
(9988776618, 'student18@gmail.com', 'Data Science', '140000\n')
(9988776619, 'student19@gmail.com', 'Data Analytics', '32500\n')
(9988776620, 'student20@gmail.com', 'Inv Banking', '41500\n')
(9988776621, 'student21@gmail.com', 'Data Science', '131000\n')
(9988776622, 'student22@gmail.com', 'Data Science', '23000\n')
(9988776623, 'student23@gmail.com', 'Data Science', '24000\n')

In [14]:
result = cursor.execute("SELECT * from stud_det")
for row in result:
    print(row)

(9988776604, 'Salah', '03-10-2020', 85)
(9988776605, 'Heung-Son', '21-06-2020', 39)
(9988776606, 'Ronaldo', '08-05-2020', 86)
(9988776607, 'Kane', '11-05-2022', 57)
(9988776608, 'Mane', '17-05-2022', 52)
(6609998877, 'Vardy', '17-12-2020', 54)
(6609998878, 'Jota', '06-11-2021', 45)
(6609998879, 'Bruyne', '26-11-2020', 49)
(6609998880, 'Zaha', '05-12-2020', 88)
(6609998881, 'Sterling', '29-10-2020', 61)
(9988776614, 'Toney', '31-03-2022', 71)
(9988776615, 'Maddison', '10-03-2020', 44)
(1687799866, 'Bowen', '14-02-2021', 96)
(1687799867, 'Saka', '19-12-2022', 92)
(1687799868, 'Watkins', '30-01-2021', 49)
(1687799869, 'Mount', '16-09-2022', 48)
(1687799870, 'Raphael', '15-05-2021', 50)
(1687799871, 'Mahrez', '30-10-2021', 72)
(9988776622, 'Pukki', '19-02-2021', 93)
(9988776623, 'Fernandes', '01-03-2022', 94)

# inner join:

In [16]:
sql = "select student_data5.phone_no ,stud_det.enrolled_date,stud_det.marks , stud_det.student_name FROM stud_det INNER join student_data5 on student_data5.phone_no = stud_det.phone_no"
result = cursor.execute(sql)                                                                        #from 1st table inner join 2nd table on behalf of phone_no
for row in result:                                                                                                      #whichever phone_no are same only those records are printed
    print(row)                    #we will join on the basis of primary key which are unique eg here phone_no

(9988776604, '03-10-2020', 85, 'Salah')
(9988776605, '21-06-2020', 39, 'Heung-Son')
(9988776606, '08-05-2020', 86, 'Ronaldo')
(9988776607, '11-05-2022', 57, 'Kane')
(9988776608, '17-05-2022', 52, 'Mane')
(9988776614, '31-03-2022', 71, 'Toney')
(9988776615, '10-03-2020', 44, 'Maddison')
(9988776622, '19-02-2021', 93, 'Pukki')
(9988776623, '01-03-2022', 94, 'Fernandes')

# left join:

In [17]:
sql = "select student_data5.phone_no ,stud_det.enrolled_date,stud_det.marks , stud_det.student_name FROM stud_det left join student_data5 on student_data5.phone_no = stud_det.phone_no"
result = cursor.execute(sql)                                                                        #from 1st table inner join 2nd table on behalf of phone_no
for row in result:                                                                                                      #whichever phone_no are same only those records are printed
    print(row)

(9988776604, '03-10-2020', 85, 'Salah')
(9988776605, '21-06-2020', 39, 'Heung-Son')
(9988776606, '08-05-2020', 86, 'Ronaldo')
(9988776607, '11-05-2022', 57, 'Kane')
(9988776608, '17-05-2022', 52, 'Mane')
(None, '17-12-2020', 54, 'Vardy')
(None, '06-11-2021', 45, 'Jota')
(None, '26-11-2020', 49, 'Bruyne')
(None, '05-12-2020', 88, 'Zaha')
(None, '29-10-2020', 61, 'Sterling')
(9988776614, '31-03-2022', 71, 'Toney')
(9988776615, '10-03-2020', 44, 'Maddison')
(None, '14-02-2021', 96, 'Bowen')
(None, '19-12-2022', 92, 'Saka')
(None, '30-01-2021', 49, 'Watkins')
(None, '16-09-2022', 48, 'Mount')
(None, '15-05-2021', 50, 'Raphael')
(None, '30-10-2021', 72, 'Mahrez')
(9988776622, '19-02-2021', 93, 'Pukki')
(9988776623, '01-03-2022', 94, 'Fernandes')

right join and outer join not supported in sqlite3

# python and sql(how to use together)

In [ ]:
# while True:
    try:
        ph_num = int(input("your mobile no"))
        if len(str(ph_num)) != 10:
            print("phone no is incorrect")
            continue
        else:
            result = cursor.execute("select * from student_data5")
            for detail in result:
                if detail[0] == ph_num:               #here detail[0] shows 0 index column that is phone no likiewise 1 is name or etc
                    print('Name =' , detail[1])
                    print('dob = ' , detail[2])
                    print('mark =' , detail[3])
                    break
            else:
                print('phone no not found in data base')
                continue
            break
    except:
        print('phone no should be numeric')
        continue

In [ ]:
#drop any table 
#sql = "DROP TABLE student_data"
#cursor.execute(sql)

In [ ]:
sql = 'DROP TABLE stud_det'
cursor.execute(sql)